Revit 2024 API
WorksharingSaveAsOptions.OpenWorksetsDefault Property
 The default set of user-worksets to open when opening the model in the UI. Default is AskUserToSpecify.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public SimpleWorksetConfiguration OpenWorksetsDefault { get; set; }
Visual Basic
Public Property OpenWorksetsDefault As SimpleWorksetConfiguration
	Get
	Set
Visual C++
public:
property SimpleWorksetConfiguration OpenWorksetsDefault {
	SimpleWorksetConfiguration get ();
	void set (SimpleWorksetConfiguration value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
WorksharingSaveAsOptions Class
Autodesk.Revit.DB Namespace